IDENTIFICATION DIVISION.

PROGRAM-ID. TEMPERATURE-CONVERSION.
AUTHOR. OLGA ZIMINA.
*-----------------------------------------

DATA DIVISION.

WORKING-STORAGE SECTION.
01  TEMPERATURE-VARIABLES.
05     CELSIUS-VALUE PIC 9(3) VALUE ZERO.
05     START-CELSIUS-TEMP PIC 9(3) VALUE ZERO.
05     CELSIUS-INCREMENT PIC 9(2) VALUE ZERO.
05     CELSIUS-FINAL-TEMP PIC 9(3) VALUE ZERO.
01  CONVERSION-DETAIL-RECORD.
05     CELSIUS-VALUE-OUT PIC 9(3).
05     FILLER PIC X(3) VALUE SPACES.
05     FAHRENHEIT-TEMP PIC 9(3).

PROCEDURE DIVISION.

100-Produce-Celsius-Conversions SECTION.
    PERFORM 200-Initialize-Celsius-Variables
    PERFORM 201-Produce-One-Celsius-Conversion
        VARYING CELSIUS-VALUE
            FROM START-CELSIUS-TEMP
            BY CELSIUS-INCREMENT
            UNTIL CELSIUS-VALUE-OUT > CELSIUS-FINAL-TEMP.
    PERFORM 202-Terminate-Comission-Report.

200-Initialize-Celsius-Variables SECTION.
    DISPLAY 'ENTER INITIAL CELSIUS VALUE'
    ACCEPT START-CELSIUS-TEMP.
    DISPLAY 'ENTER FINAL CELSIUS VALUE'
    ACCEPT CELSIUS-FINAL-TEMP.
    DISPLAY 'ENTER INCREMENT FOR CELSIUS VALUE'
    ACCEPT CELSIUS-INCREMENT.

201-Produce-One-Celsius-Conversion SECTION.
    MOVE CELSIUS-VALUE TO CELSIUS-VALUE-OU
    COMPUTE FAHRENHEIT-TEMP = CELSIUS-VALUE * (9 / 5) + 32
    DISPLAY CONVERSION-DETAIL-RECORD.

202-Terminate-Comission-Report SECTION.
    STOP 'Press <CR> to terminate'
    STOP RUN.
*-----------------------------------------
